MSCFISHPA/app/controllers/api/v1/events_controller.rb

  def index
    event = Event.all.order(created_at: :desc)
---
SELECT "events".* FROM "events" ORDER BY "events"."created_at" DESC

  def create
    event = Event.create!(event_params)
---
INSERT INTO "events" ("name", "max_size", "tickets_sold", "num_checked_in", "date", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    event&.destroy
---
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 10]]

  def event
    @event ||= Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]