app/controllers/api/v1/announcements_controller.rb

      def index
        announcement = Announcement.all.order(created_at: :desc)
---
SELECT "announcements".* FROM "announcements" ORDER BY "announcements"."created_at" DESC

      def create
        announcement = Announcement.create!(announcement_params)
---
INSERT INTO "announcements" ("author_id", "event_id", "content", "external", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["author_id", 1], ["event_id", 1], ["content", "test1"], ["external", true], ["created_at", "2021-03-29 21:40:05.408435"], ["updated_at", "2021-03-29 21:40:05.408435"]]

      def destroy
        announcement&.destroy
---
DELETE FROM "announcements" WHERE "announcements"."id" = $1  [["id", 10]]

      def overwrite
        @announcements = Announcement.all
        @announcements.each do |f|
---
SELECT "announcements".* FROM "announcements"

      def announcement
        @announcement ||= Announcement.find(params[:id])
---
SELECT "announcements".* FROM "announcements" WHERE "announcements"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]