app/controllers/api/v1/announcements_controller.rb

      def index
        announcement = if params.key?(:external)
                         Announcement.where(external: true?(params[:external]))
---
SELECT "announcements".* FROM "announcements" WHERE "announcements"."external" = $1  [["external", true]]