app/controllers/api/v1/attendees_controller.rb

SELECT "attendees".* FROM "attendees" ORDER BY "attendees"."created_at" DESC
---
      def index
        attendee = Attendee.all.order(created_at: :desc)

INSERT INTO "attendees" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test"], ["email", "test@test.com"], ["created_at", "2021-03-22 20:35:38.775815"], ["updated_at", "2021-03-22 20:35:38.775815"]]
SELECT "members".* FROM "members" WHERE "members"."name" = $1 LIMIT $2  [["name", "Test 0"], ["LIMIT", 1]]
UPDATE "members" SET "num_referrals" = COALESCE("num_referrals", 0) + $1 WHERE "members"."id" = $2  [["num_referrals", 1], ["id", 1]]
INSERT INTO "referrals" ("member_id", "attendee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["member_id", 4], ["attendee_id", 6], ["created_at", "2021-03-23 05:54:34.363251"], ["updated_at", "2021-03-23 05:54:34.363251"]]
INSERT INTO "eventattendances" ("event_id", "attendee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 1], ["attendee_id", 6], ["created_at", "2021-03-23 05:54:34.419916"], ["updated_at", "2021-03-23 05:54:34.419916"]]
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "num_checked_in" = COALESCE("num_checked_in", 0) + $1 WHERE "events"."id" = $2  [["num_checked_in", 1], ["id", 1]]
---
      def create
        attendee = Attendee.create!(attendee_params)

        member = Member.find_by!(name: params[:referral])
        member.increment!(:num_referrals)
        member.reload.num_referrals

        Referral.create!(member_id: member.id, attendee_id: attendee.id)

        Eventattendance.create!(event_id: params[:event_id], attendee_id: attendee.id)

        event = Event.find_by!(id: params[:event_id])
        event.increment!(:num_checked_in)

SELECT "attendees".* FROM "attendees"
---
      def overwrite
        @attendees = Attendee.all
        @attendees.each do |f|

SELECT "attendees".* FROM "attendees" WHERE "attendees"."email" = $1 LIMIT $2  [["email", "test@test.com"], ["LIMIT", 1]]
UPDATE "attendees" SET "name" = $1, "updated_at" = $2 WHERE "attendees"."id" = $3  [["name", "asdf"], ["updated_at", "2021-03-22 20:53:10.544283"], ["id", 1]]
---
      def update
        attendee = Attendee.find_by!(email: params[:email])
        attendee.update(name: params[:name])