app/controllers/api/v1/events_controller.rb

      def destroy
        event&.destroy
---
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]