app/controllers/api/v1/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
      def event
        @event ||= Event.find(params[:id])