app/controllers/api/v1/members_controller.rb

      def index
        member = Member.all.order(first_name: :desc)
---
SELECT "members".* FROM "members" ORDER BY "members"."first_name" DESC

      def create
        member = Member.create!(member_params)
---
INSERT INTO "members" ("role_id", "first_name", "last_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["role_id", 1], ["first_name", "Test 3"], ["last_name", "Test 3"], ["email", "test3@test.com"], ["created_at", "2021-04-06 23:13:19.173651"], ["updated_at", "2021-04-06 23:13:19.173651"]]

      def destroy
        member&.destroy
---
DELETE FROM "members" WHERE "members"."id" = $1  [["id", 9]]

      def overwrite
        @members = Member.all
        @members.each do |f|
---
SELECT "members".* FROM "members"

      def member
        @member ||= Member.find(params[:id])
---
SELECT "members".* FROM "members" WHERE "members"."id" = $1 ORDER BY "members"."id" ASC LIMIT $2  [["id", 10], ["LIMIT", 1]]