app/controllers/api/v1/referrals_controller.rb

      def index
        if(params.has_key?(:member_id))
          referral = Referral.where(:member_id => params[:member_id])
        else
          referral = Referral.all.order(created_at: :desc)
---
SELECT "referrals".* FROM "referrals" WHERE "referrals"."member_id" = $1  [["member_id", 10]]
SELECT "referrals".* FROM "referrals" ORDER BY "referrals"."created_at" DESC