app/controllers/api/v1/roles_controller.rb

      def index
        role = Role.all.order(name: :desc)
---
SELECT "roles".* FROM "roles" ORDER BY "roles"."name" DESC