app/controllers/homepage_controller.rb

SELECT "announcements".* FROM "announcements"
SELECT "events".* FROM "events" ORDER BY "events"."created_at" DESC
---
  def index
    respond_to do |format|
      format.html
      format.zip do
        @announcements = Announcement.all
        @events = Event.all