app/models/announcement.rb

  def self.to_csv
    attributes = %w[id author_id event_id title content]
    CSV.generate(headers: true) do |csv|
      csv << attributes

      all.find_each do |announcement|
---
SELECT "announcements".* FROM "announcements" ORDER BY "announcements"."id" ASC LIMIT $1  [["LIMIT", 1000]]