app/models/attendee.rb

SELECT "attendees".* FROM "attendees" ORDER BY "attendees"."id" ASC LIMIT $1  [["LIMIT", 1000]]
---
  def self.to_csv
    attributes = %w[id first_name last_name email]
    CSV.generate(headers: true) do |csv|
      csv << attributes

      all.find_each do |attendee|