app/models/eventattendance.rb

SELECT "eventattendances".* FROM "eventattendances" ORDER BY "eventattendances"."id" ASC LIMIT $1  [["LIMIT", 1000]]
---
  def self.to_csv
    attributes = %w[event_id attendee_id]
    CSV.generate(headers: true) do |csv|
      csv << attributes

      all.find_each do |eventattendance|