app/models/event.rb

  def self.to_csv
    attributes = %w[id name max_size tickets_sold num_checked_in date description]
    CSV.generate(headers: true) do |csv|
      csv << attributes

      all.find_each do |event|
---
SELECT "events".* FROM "events" ORDER BY "events"."id" ASC LIMIT $1  [["LIMIT", 1000]]