app/models/member.rb

SELECT "members".* FROM "members" ORDER BY "members"."id" ASC LIMIT $1  [["LIMIT", 1000]]
---
  def self.to_csv
    attributes = %w[id first_name last_name email num_referrals role_id]
    CSV.generate(headers: true) do |csv|
      csv << attributes

      all.find_each do |member|

SELECT 1 AS one FROM "members" WHERE "members"."email" = $1 LIMIT $2  [["email", "reo.matsuda@gmail.com"], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."email" = $1 ORDER BY "members"."id" ASC LIMIT $2  [["email", "reo.matsuda@gmail.com"], ["LIMIT", 1]]
---
  def self.from_google(email)
    email = email[:email]
    members = Member.all

    return nil unless Member.where(email: email).exists?
    return Member.where(email: email).first