app/models/referral.rb

  def self.to_csv
    attributes = %w[member_id attendee_id]
    CSV.generate(headers: true) do |csv|
      csv << attributes

      all.find_each do |referral|
---
SELECT "referrals".* FROM "referrals" ORDER BY "referrals"."id" ASC LIMIT $1  [["LIMIT", 1000]]