app/models/role.rb

  def self.to_csv
    attributes = %w[id name description]
    CSV.generate(headers: true) do |csv|
      csv << attributes

      all.find_each do |role|
---
SELECT "roles".* FROM "roles" ORDER BY "roles"."id" ASC LIMIT $1  [["LIMIT", 1000]]